<?php
/**
 * @author: Marina Mileva m934222258@gmail.com
 * @since: 16.05.18 17:40
 */

namespace GepurIt\PhoneNumber;

/**
 * Class PhoneNumberHelper
 * @package GepurIt\PhoneNumber
 */
class PhoneNumberHelper
{
    const UA_REGEXP = '/^\+?3?8?(0\d{9})/';
    const PHONE_CODES_UKRAINE = [
        '039', '067', '068', '096', '097', '098',   // Kyivstar
        '050', '066', '095', '099',                 // MTC
        '063', '071', '073', '093',                 // Life
        '091',                                      // Utel
        '092',                                      // Peoplenet
        '094',                                      // Intertelecom
        '043',  // Vinnitza
        '056',  // Dnepr
        '062',  // Donetzk
        '041',  // Zhitomir
        '061',  // Zaporozhie
        '034',  // Ivano-Frankovsk
        '045',  // Kyiv oblast
        '044',  // Kyiv city
        '052',  // Kripivnitzkiy
        '064',  // Lugansk
        '033',  // Lutzk
        '032',  // Lviv
        '051',  // Mykolaiv
        '048',  // Odesa
        '053',  // Poltava
        '036',  // Rovno
        '069',  // Sevastopol
        '065',  // Simferopol
        '054',  // Sumy
        '035',  // Ternopil
        '031',  // Uzhgorod
        '057',  // Kharkiv
        '055',  // Kherson
        '038',  // Khmelnitzkyi
        '047',  // Cherkassy
        '046',  // Chernigov
        '037',  // Chernovtzy
    ];

    /**
     * Country calling codes
     * @see https://en.wikipedia.org/wiki/List_of_country_calling_codes
     * @see https://ru.wikipedia.org/wiki/%D0%A2%D0%B5%D0%BB%D0%B5%D1%84%D0%BE%D0%BD%D0%BD%D1%8B%D0%B5_%D0%BA%D0%BE%D0%B4%D1%8B_%D1%81%D1%82%D1%80%D0%B0%D0%BD
     * It is also checked against the current official documentation of telecommunications companies and international organizations
     * ToDo: translate countries to English
     */
    const PHONE_CODES_RU = [
        // 'США, Канада и Карибсий бассейн'
        '1' => [
            4 => [
                // США
                '1208' => 'США, Айдахо',
                '1319' => 'США, Айова',
                '1515' => 'США, Айова',
                '1563' => 'США, Айова',
                '1641' => 'США, Айова',
                '1712' => 'США, Айова',
                '1205' => 'США, Алабама',
                '1251' => 'США, Алабама',
                '1256' => 'США, Алабама',
                '1334' => 'США, Алабама',
                '1938' => 'США, Алабама',
                '1907' => 'США, Аляска',
                '1480' => 'США, Аризона',
                '1520' => 'США, Аризона',
                '1665' => 'США, Аризона',
                '1623' => 'США, Аризона',
                '1928' => 'США, Аризона',
                '1479' => 'США, Арканзас',
                '1501' => 'США, Арканзас',
                '1870' => 'США, Арканзас',
                '1307' => 'США, Вайоминг',
                '1206' => 'США, Вашингтон',
                '1253' => 'США, Вашингтон',
                '1360' => 'США, Вашингтон',
                '1425' => 'США, Вашингтон',
                '1509' => 'США, Вайоминг',
                '1802' => 'США, Вермонт',
                '1276' => 'США, Виргиния',
                '1434' => 'США, Виргиния',
                '1540' => 'США, Виргиния',
                '1571' => 'США, Виргиния',
                '1703' => 'США, Виргиния',
                '1757' => 'США, Виргиния',
                '1804' => 'США, Виргиния',
                '1262' => 'США, Висконсин',
                '1414' => 'США, Висконсин',
                '1534' => 'США, Висконсин',
                '1608' => 'США, Висконсин',
                '1715' => 'США, Висконсин',
                '1920' => 'США, Висконсин',
                '1808' => 'США, Гавайи',
                '1302' => 'США, Делавэр',
                '1229' => 'США, Джорджия',
                '1404' => 'США, Джорджия',
                '1478' => 'США, Джорджия',
                '1678' => 'США, Джорджия',
                '1706' => 'США, Джорджия',
                '1762' => 'США, Джорджия',
                '1770' => 'США, Джорджия',
                '1912' => 'США, Джорджия',
                '1304' => 'США, Западная Виргиния',
                '1681' => 'США, Западная Виргиния',
                '1217' => 'США, Иллинойс',
                '1224' => 'США, Иллинойс',
                '1309' => 'США, Иллинойс',
                '1312' => 'США, Иллинойс',
                '1331' => 'США, Иллинойс',
                '1618' => 'США, Иллинойс',
                '1630' => 'США, Иллинойс',
                '1708' => 'США, Иллинойс',
                '1773' => 'США, Иллинойс',
                '1779' => 'США, Иллинойс',
                '1815' => 'США, Иллинойс',
                '1847' => 'США, Иллинойс',
                '1872' => 'США, Иллинойс',
                '1219' => 'США, Индиана',
                '1260' => 'США, Индиана',
                '1317' => 'США, Индиана',
                '1574' => 'США, Индиана',
                '1765' => 'США, Индиана',
                '1812' => 'США, Индиана',
                '1209' => 'США, Калифорния',
                '1213' => 'США, Калифорния',
                '1310' => 'США, Калифорния',
                '1323' => 'США, Калифорния',
                '1408' => 'США, Калифорния',
//                '1415' => 'США, Калифорния',
                '1424' => 'США, Калифорния',
                '1442' => 'США, Калифорния',
                '1510' => 'США, Калифорния',
                '1530' => 'США, Калифорния',
                '1559' => 'США, Калифорния',
                '1562' => 'США, Калифорния',
                '1619' => 'США, Калифорния',
                '1626' => 'США, Калифорния',
                '1650' => 'США, Калифорния',
                '1657' => 'США, Калифорния',
                '1661' => 'США, Калифорния',
                '1707' => 'США, Калифорния',
                '1714' => 'США, Калифорния',
                '1747' => 'США, Калифорния',
                '1760' => 'США, Калифорния',
                '1805' => 'США, Калифорния',
                '1818' => 'США, Калифорния',
                '1831' => 'США, Калифорния',
                '1858' => 'США, Калифорния',
                '1909' => 'США, Калифорния',
                '1916' => 'США, Калифорния',
                '1925' => 'США, Калифорния',
                '1949' => 'США, Калифорния',
                '1951' => 'США, Калифорния',
                '1415' => 'США, Калифорния, Сан-Франциско',
                '1316' => 'США, Канзас',
                '1620' => 'США, Канзас',
                '1785' => 'США, Канзас',
                '1913' => 'США, Канзас',
                '1270' => 'США, Кентукки',
                '1502' => 'США, Кентукки',
                '1606' => 'США, Кентукки',
                '1859' => 'США, Кентукки',
                '1303' => 'США, Колорадо',
                '1719' => 'США, Колорадо',
                '1720' => 'США, Колорадо',
                '1970' => 'США, Колорадо',
                '1203' => 'США, Коннектикуд',
                '1475' => 'США, Коннектикуд',
                '1860' => 'США, Коннектикуд',
                '1225' => 'США, Луизиана',
                '1318' => 'США, Луизиана',
                '1337' => 'США, Луизиана',
                '1504' => 'США, Луизиана',
                '1985' => 'США, Луизиана',
                '1339' => 'США, Массачусетс',
                '1351' => 'США, Массачусетс',
                '1413' => 'США, Массачусетс',
                '1508' => 'США, Массачусетс',
                '1617' => 'США, Массачусетс',
                '1774' => 'США, Массачусетс',
                '1781' => 'США, Массачусетс',
                '1857' => 'США, Массачусетс',
                '1978' => 'США, Массачусетс',
                '1218' => 'США, Миннесота',
                '1320' => 'США, Миннесота',
                '1507' => 'США, Миннесота',
                '1612' => 'США, Миннесота',
                '1651' => 'США, Миннесота',
                '1763' => 'США, Миннесота',
                '1952' => 'США, Миннесота',
                '1228' => 'США, Миссисипи',
                '1601' => 'США, Миссисипи',
                '1662' => 'США, Миссисипи',
                '1769' => 'США, Миссисипи',
                '1314' => 'США, Миссури',
                '1417' => 'США, Миссури',
                '1573' => 'США, Миссури',
                '1636' => 'США, Миссури',
                '1660' => 'США, Миссури',
                '1816' => 'США, Миссури',
                '1231' => 'США, Мичиган',
                '1248' => 'США, Мичиган',
                '1269' => 'США, Мичиган',
                '1313' => 'США, Мичиган',
                '1517' => 'США, Мичиган',
                '1586' => 'США, Мичиган',
                '1616' => 'США, Мичиган',
                '1734' => 'США, Мичиган',
                '1810' => 'США, Мичиган',
                '1906' => 'США, Мичиган',
                '1947' => 'США, Мичиган',
                '1989' => 'США, Мичиган',
                '1406' => 'США, Монтана',
                '1207' => 'США, Мэн',
                '1240' => 'США, Мэриленд',
                '1301' => 'США, Мэриленд',
                '1410' => 'США, Мэриленд',
                '1443' => 'США, Мэриленд',
                '1308' => 'США, Небраска',
                '1402' => 'США, Небраска',
                '1531' => 'США, Небраска',
                '1702' => 'США, Невада',
                '1775' => 'США, Невада',
                '1603' => 'США, Нью-Гэмпшир',
                '1201' => 'США, Нью-Джерси',
                '1551' => 'США, Нью-Джерси',
                '1609' => 'США, Нью-Джерси',
                '1732' => 'США, Нью-Джерси',
                '1848' => 'США, Нью-Джерси',
                '1856' => 'США, Нью-Джерси',
                '1862' => 'США, Нью-Джерси',
                '1908' => 'США, Нью-Джерси',
                '1973' => 'США, Нью-Джерси',
                '1212' => 'США, Нью-Йорк (штат)',
                '1315' => 'США, Нью-Йорк (штат)',
                '1347' => 'США, Нью-Йорк (штат)',
                '1516' => 'США, Нью-Йорк (штат)',
                '1518' => 'США, Нью-Йорк (штат)',
                '1607' => 'США, Нью-Йорк (штат)',
                '1631' => 'США, Нью-Йорк (штат)',
                '1646' => 'США, Нью-Йорк (штат)',
                '1716' => 'США, Нью-Йорк (штат)',
                '1718' => 'США, Нью-Йорк (штат)',
                '1845' => 'США, Нью-Йорк (штат)',
                '1914' => 'США, Нью-Йорк (штат)',
                '1917' => 'США, Нью-Йорк (штат)',
                '1929' => 'США, Нью-Йорк (штат)',
                '1505' => 'США, Нью-Мексико',
                '1575' => 'США, Нью-Мексико',
                '1216' => 'США, Огайо',
                '1234' => 'США, Огайо',
                '1330' => 'США, Огайо',
                '1419' => 'США, Огайо',
                '1440' => 'США, Огайо',
                '1513' => 'США, Огайо',
                '1567' => 'США, Огайо',
                '1614' => 'США, Огайо',
                '1740' => 'США, Огайо',
                '1937' => 'США, Огайо',
                '1405' => 'США, Оклахома',
                '1539' => 'США, Оклахома',
                '1580' => 'США, Оклахома',
                '1918' => 'США, Оклахома',
                '1202' => 'США, Округ Колумбия (Вашингтон)',
                '1458' => 'США, Орегон',
                '1503' => 'США, Орегон',
                '1541' => 'США, Орегон',
                '1971' => 'США, Орегон',
                '1215' => 'США, Пенсильвания',
                '1267' => 'США, Пенсильвания',
                '1412' => 'США, Пенсильвания',
                '1484' => 'США, Пенсильвания',
                '1570' => 'США, Пенсильвания',
                '1610' => 'США, Пенсильвания',
                '1717' => 'США, Пенсильвания',
                '1724' => 'США, Пенсильвания',
                '1814' => 'США, Пенсильвания',
                '1878' => 'США, Пенсильвания',
                '1401' => 'США, Род-Айленд',
                '1701' => 'США, Северная Дакота',
                '1252' => 'США, Северная Каролина',
                '1336' => 'США, Северная Каролина',
                '1704' => 'США, Северная Каролина',
                '1828' => 'США, Северная Каролина',
                '1910' => 'США, Северная Каролина',
                '1919' => 'США, Северная Каролина',
                '1980' => 'США, Северная Каролина',
                '1423' => 'США, Теннесси',
                '1615' => 'США, Теннесси',
                '1731' => 'США, Теннесси',
                '1865' => 'США, Теннесси',
                '1901' => 'США, Теннесси',
                '1931' => 'США, Теннесси',
                '1210' => 'США, Техас',
                '1214' => 'США, Техас',
                '1254' => 'США, Техас',
                '1281' => 'США, Техас',
                '1325' => 'США, Техас',
                '1361' => 'США, Техас',
                '1409' => 'США, Техас',
                '1430' => 'США, Техас',
                '1432' => 'США, Техас',
                '1469' => 'США, Техас',
                '1512' => 'США, Техас',
                '1682' => 'США, Техас',
                '1713' => 'США, Техас',
                '1806' => 'США, Техас',
                '1817' => 'США, Техас',
                '1830' => 'США, Техас',
                '1832' => 'США, Техас',
                '1903' => 'США, Техас',
                '1915' => 'США, Техас',
                '1936' => 'США, Техас',
                '1940' => 'США, Техас',
                '1956' => 'США, Техас',
                '1972' => 'США, Техас',
                '1979' => 'США, Техас',
                '1239' => 'США, Флорида',
                '1305' => 'США, Флорида',
                '1321' => 'США, Флорида',
                '1352' => 'США, Флорида',
                '1386' => 'США, Флорида',
                '1407' => 'США, Флорида',
                '1561' => 'США, Флорида',
                '1727' => 'США, Флорида',
                '1754' => 'США, Флорида',
                '1772' => 'США, Флорида',
                '1786' => 'США, Флорида',
                '1813' => 'США, Флорида',
                '1850' => 'США, Флорида',
                '1863' => 'США, Флорида',
                '1904' => 'США, Флорида',
                '1941' => 'США, Флорида',
                '1954' => 'США, Флорида',
                '1605' => 'США, Южная Дакота',
                '1803' => 'США, Южная Каролина',
                '1843' => 'США, Южная Каролина',
                '1864' => 'США, Южная Каролина',
                '1385' => 'США, Юта',
                '1435' => 'США, Юта',
                '1801' => 'США, Юта',
                '1684' => 'США, Океания, Американское Самоа',
                '1671' => 'США, Океания, Гуам',
                '1670' => 'США, Океания, Марианские острова (Сайпан)',

                // Канада
                '1403' => 'Канада, Альберта',
                '1250' => 'Канада, Британская Колумбия',
                '1604' => 'Канада, Британская Колумбия',
                '1778' => 'Канада, Британская Колумбия',
                '1418' => 'Канада, Квебек',
                '1438' => 'Канада, Квебек',
                '1450' => 'Канада, Квебек',
                '1514' => 'Канада, Квебек',
                '1579' => 'Канада, Квебек',
                '1581' => 'Канада, Квебек',
                '1819' => 'Канада, Квебек',
                '1204' => 'Канада, Манитоба',
                '1902' => 'Канада, Новая Шотландия / Остров Принца Эдуарда',
                '1867' => 'Канада, Нунавут / Северо-Западные территории / Юкон',
                '1506' => 'Канада, Нью-Брансуик',
                '1709' => 'Канада, Ньюфаундленд и Лабрадор',
                '1226' => 'Канада, Онтарио',
                '1249' => 'Канада, Онтарио',
                '1289' => 'Канада, Онтарио',
                '1343' => 'Канада, Онтарио',
                '1416' => 'Канада, Онтарио',
                '1519' => 'Канада, Онтарио',
                '1613' => 'Канада, Онтарио',
                '1647' => 'Канада, Онтарио',
                '1705' => 'Канада, Онтарио',
                '1807' => 'Канада, Онтарио',
                '1905' => 'Канада, Онтарио',
                '1306' => 'Канада, Саскачеван',

                // страны Карибского бассейна
                '1340' => 'Американские Виргинские острова',
                '1264' => 'Ангилья',
                '1268' => 'Антигуа и Барбуда',
                '1242' => 'Багамы',
                '1246' => 'Барбадос',
                '1441' => 'Бермуды',
                '1284' => 'Британские Виргинские острова',
                '1473' => 'Гренада',
                '1767' => 'Доминика',
                '1809' => 'Доминиканская Республика',
                '1829' => 'Доминиканская Республика',
                '1849' => 'Доминиканская Республика',
                '1345' => 'Каймановы острова',
                '1664' => 'Монтсеррат',
                '1649' => 'Острова Теркс и Кайкос',
                '1787' => 'Пуэрто-Рико',
                '1939' => 'Пуэрто-Рико',
                '1784' => 'Сент-Винсент и Гренадины',
                '1869' => 'Сент-Китс и Невис',
                '1758' => 'Сент-Люсия',
                '1868' => 'Тринидад и Тобаго',
                '1876' => 'Ямайка',
            ],
        ],
        // 'Африка', // will be filled in the future
        '2' => [
            2 => [
                '20' => 'Египет',
                '27' => 'Южная Африка',
            ],
            3 => [
                '211' => 'Южный Судан',
                '212' => 'Марокко',
                '213' => 'Алжир',
                '216' => 'Тунис',
                '218' => 'Ливия',
                '220' => 'Гамбия',
                '221' => 'Сенегал',
                '222' => 'Мавритания',
                '223' => 'Мали',
                '224' => 'Гвинея',
                '225' => "Кот-д'Ивуар",
                '226' => 'Буркина-Фасо',
                '227' => 'Нигер',
                '228' => 'Того',
                '229' => 'Бенин',
                '230' => 'Маврикий',
                '231' => 'Либерия',
                '232' => 'Сьерра-Леоне',
                '233' => 'Гана',
                '234' => 'Нигерия',
                '235' => 'Чад',
                '236' => 'Центральноафриканская Республика',
                '237' => 'Камерун',
                '238' => 'Кабо-Верде',
                '239' => 'Сан-Томе и Принсипи',
                '240' => 'Экваториальная Гвинея',
                '241' => 'Габон',
                '242' => 'Конго (Браззавиль)',
                '243' => 'Демократическая Республика Конго (Киншаса)',
                '244' => 'Ангола',
                '245' => 'Гвинея-Бисау',
                '246' => 'Британская территория в Индийском океане',
                '247' => 'Остров Вознесения',
                '248' => 'Сейшелы',
                '249' => 'Судан',
                '250' => 'Руанда',
                '251' => 'Эфиопия',
                '252' => 'Сомали',
                '253' => 'Джибути',
                '254' => 'Кения',
                '255' => 'Танзания',
                '256' => 'Уганда',
                '257' => 'Бурунди',
                '258' => 'Мозамбик',
                '260' => 'Замбия',
                '261' => 'Мадагаскар',
                '262' => 'Реюньон и острова Майотта',
                '263' => 'Зимбабве',
                '264' => 'Намибия',
                '265' => 'Малави',
                '266' => 'Лесото',
                '267' => 'Ботсвана',
                '268' => 'Свазиленд',
                '269' => 'Коморские Острова',
                '290' => 'Остров Святой Елены',
                '291' => 'Эритрея',
                '297' => 'Аруба',
                '298' => 'Фарерские острова',
                '299' => 'Гренландия',
            ],
        ],
        '3' => [
            2 => [
                '30' => "Греция",
                '31' => "Нидерланлды",
                '32' => "Бельгия",
                '33' => "Франция",
                '34' => "Испания",
                '36' => "Венгрия",
                '39' => "Италия",
            ],
            3 => [
                '350' => "Гибралтар",
                '351' => "Португалия",
                '352' => "Люксембург",
                '353' => "Ирландия",
                '354' => "Исландия",
                '355' => "Албания",
                '356' => "Мальта",
                '357' => "Кипр",
                '358' => "Финляндия",
                '359' => "Болгария",
                '370' => "Литва",
                '371' => "Латвия",
                '372' => "Эстония",
                '373' => "Молдова",
                '374' => "Армения",
                '375' => "Беларусь",
                '376' => "Андорра",
                '377' => "Монако",
                '378' => "Сан-Марино",
                '379' => "Ватикан",
                '380' => "Украина",
                '381' => "Сербия",
                '382' => "Черногория",
                '383' => "Косово",
                '385' => "Хорватия",
                '386' => "Словения",
                '387' => "Босния и Герцеговина",
                '389' => "Македония",
            ]
        ],
        '4' => [
            2 => [
                '40' => 'Румыния',
                '41' => 'Швейцария',
                '43' => 'Австрия',
                '44' => 'Великобритания',
                '45' => 'Дания',
                '46' => 'Швеция',
                '47' => 'Норвегия',
                '48' => 'Польша',
                '49' => 'Германия',
            ],
            3 => [
                '420' => 'Чехия',
                '421' => 'Словакия',
                '423' => 'Лихтенштейн',
            ],
        ],
        '5' => 'Южная и Центральная Америка', // will be filled in the future
        '6' => 'Австралия, Океания, Таиланд, Сингапур', // will be filled in the future
        '7' => [
            2 => [
                '73' => 'Россия',
                '74' => 'Россия',
                '75' => 'Россия',
                '78' => 'Россия',
                '79' => 'Россия',
                '76' => 'Казахстан',
                '77' => 'Казахстан',
            ],
        ],
        // 'Азия Юго-Восточная'
        '8' => [
            2 => [
                '81' => 'Япония',
                '82' => 'Южная Корея',
                '83' => 'Для спецслужб КНДР',
                '84' => 'Вьетнам',
                '86' => 'Китай Континентальный',
            ],
            3 => [
                '800' => 'Все страны',
                '808' => 'Shared Cost Services',
                '850' => 'КНДР (Северная Корея)',
                '852' => 'Гонконг',
                '853' => 'Макао',
                '855' => 'Камбоджа',
                '856' => 'Лаос',
                '870' => 'служба Inmarsat «SNAC»',
                '871' => 'Inmarsat Атлантический Океан, восток (AOR-E)',
                '872' => 'Inmarsat Тихоокеанский регион (POR)',
                '873' => 'Inmarsat Индийский Океан (IOR)',
                '874' => 'Inmarsat Атлантический Океан, запад (AOR-W)',
                '875' => 'для службы Maritime Mobile',
                '876' => 'для службы Maritime Mobile',
                '877' => 'для службы Maritime Mobile',
                '878' => 'служба Universal Personal Telecommunications',
                '879' => 'для внутреннего использования mobile/maritime',
                '880' => 'Бангладеш',
                '881' => 'Mobile Satellite System',
                '882' => 'International Networks',
                '883' => 'International Networks',
                '886' => 'Тайвань',
            ],
        ],
        '9' => [
            2 => [
                '90' => 'Турция',
                '91' => 'Индия',
                '92' => 'Пакистан',
                '93' => 'Афганистан',
                '94' => 'Шри-Ланка',
                '95' => 'Мьянма',
                '98' => 'Иран',
            ],
            3 => [
                '960' => 'Мальдивские острова',
                '961' => 'Ливан',
                '962' => 'Иордания',
                '963' => 'Сирия',
                '964' => 'Ирак',
                '965' => 'Кувейт',
                '966' => 'Саудовская Аравия',
                '967' => 'Йемен',
                '968' => 'Оман',
                '970' => 'Палестина',
                '971' => 'Объединенные Арабские Эмираты',
                '972' => 'Израиль',
                '973' => 'Бахрейн',
                '974' => 'Катар',
                '975' => 'Бутан',
                '976' => 'Монголия',
                '977' => 'Непал',
                '979' => 'International Premium Rate Service',
                '991' => 'International Telecommunications Public Correspondence Service trial (ITPCS)',
                '992' => 'Таджикистан',
                '993' => 'Туркменистан',
                '994' => 'Азейрбаджан',
                '995' => 'Грузия',
                '996' => 'Киргизия',
                '998' => 'Узбекистан',
                '999' => 'Universal Communications United',
            ]
        ]
    ];


    /**
     * @param PhoneNumber $phoneNumber
     * @return false|int
     */
    public function isUkrainianNumber(PhoneNumber $phoneNumber)
    {
        return preg_match(self::UA_REGEXP, $phoneNumber->getNumber());
    }

    /**
     * @param PhoneNumber $phoneNumber
     * @return bool
     */
    public function isCutUkrainian(PhoneNumber $phoneNumber)
    {
        $number = $phoneNumber->getNumber();
        if (
            ((int)$number == 0)
            || (substr($number, 0, 2) == "00") && (strlen($number) < 11)
            || ((substr($number, 0, 1) == "0") && (strlen($number) > 11))
            || strlen($number) < 9
        ) {
            return false;
        }

        return true;
    }

    /**
     * @param PhoneNumber $phoneNumber
     * @return string
     */
    public function convertToE164IfUkrainian(PhoneNumber $phoneNumber)
    {
        if(!$this->isCutUkrainian($phoneNumber)) {
            return $phoneNumber->getNumber();
        }

        $number = $phoneNumber->getNumber();

        // since Asterisk cuts the international output for Ukrainian numbers,
        // we process them - adding 38 or 380 (and non-Ukrainian ones count as it is)
        if (
            substr($number, 0, 2) == "00"
            && strlen($number) == 11
            && in_array(substr($number, 1, 3), self::PHONE_CODES_UKRAINE)
        ) {
            $number = substr($number, 1);
            return '38'.$number;
        }

        if ((strlen($number) == 10) &&
            in_array(substr($number, 0, 3), self::PHONE_CODES_UKRAINE)
        ) {
            return '38'.$number;
        }

        if ((strlen($number) == 9) &&
            in_array('0'.substr($number, 0, 2), self::PHONE_CODES_UKRAINE)
        ) {
            return '380'.$number;
        }

        return $number;
    }
    
    
    /**
     * @param PhoneNumber $phoneNumber
     * @return string
     * empty return = undefined country
     */
    public function getCountry(PhoneNumber $phoneNumber)
    {
        $phone = $this->convertToE164IfUkrainian($phoneNumber);
        $first = $phone[0];
        if (!array_key_exists($first, self::PHONE_CODES_RU)) {
            return '';
        } 
        
        foreach ([2,3,4] as $digits) {
            $searchStart = substr($phone, 0, $digits);
            if (
                isset(self::PHONE_CODES_RU[$first][$digits]) &&
                isset(self::PHONE_CODES_RU[$first][$digits][$searchStart])
            ) {
                return self::PHONE_CODES_RU[$first][$digits][$searchStart];
            }
        }
      
        return '';
    }
}
